Repository: asiliuk/BsuirScheduleApp
Catalog: BsuirScheduleApp/Resources/Localizable.xcstrings
Source language: ru
Languages: be, en, uk

# screen.settings.whatsNew.3_0.freshStart.subtitle
source: Внутренняя архитектура была переписана для более легких улучшений и модификаций. Это позволит мне гораздо проще добавлять новые функции
be: Унутраная архітэктура была перапісана для лягчэйшых паляпшэнняў і мадыфікацый. Гэта дазволіць мне значна прасцей дадаваць новыя функцыі
en: Internal architecture was rewritten to support easier extensions and modifications. This will allow me to add new features much more easily
uk: Внутрішня архітектура була переписана для більш легких покращень та модифікацій. Це дозволить мені набагато простіше додавати нові функції

# screen.settings.whatsNew.3_0.freshStart.title
source: Новое начало!
be: Новы пачатак!
en: Fresh start!
uk: Новий початок!

# screen.settings.whatsNew.3_0.meta.subtitle
source: Этот экран был добавлен, чтобы я мог уведомлять вас о новых важных функциях, которые появятся в приложении
be: Гэты экран быў дададзены, каб я мог апавяшчаць вас аб новых важных функцыях, якія з'явяцца ў дадатку
en: This screen was added to make sure I could notify you about important new features coming to the app
uk: Цей екран був доданий, щоб я міг повідомляти вас про нові важливі функції, які з'являться в програмі

# screen.settings.whatsNew.3_0.meta.title
source: Очень мета
be: Вельмі мэта
en: Very meta
uk: Дуже мета

# screen.settings.whatsNew.3_0.pin.subtitle
source: Закрепите расписание, и оно будет ГЛАВНЫМ. Оно будет отображаться в виджете без каких-либо настроек!
be: Замацуеце расклад, і ён будзе ГАЛОЎНЫМ. Ён будзе адлюстроўвацца ў віджэце без якіх-небудзь налад!
en: Pin schedule and it will be the MAIN one. It will be displayed in widget without any configuration!
uk: Закріпіть розклад, і він буде ГОЛОВНИМ. Він буде відображатися у віджеті без будь-яких налаштувань!

# screen.settings.whatsNew.3_0.pin.title
source: Закрепленное расписание
be: Замацаваны расклад
en: Pinned schedule
uk: Закріплений розклад

# screen.settings.whatsNew.3_0.subscription.subtitle
source: Вы можете поддержать разработчика (меня), подписавшись на Premium Club или оставив чаевые!
be: Вы можаце падтрымаць распрацоўніка (мяне), падпісаўшыся на Premium Club або пакінуўшы гасцінец!
en: Support developer by subscribing to Premium Club or leaving a tip!
uk: Ви можете підтримати розробника (мене), підписавшись на Premium Club або залишивши чайові!

# screen.settings.whatsNew.3_0.subscription.title
source: Устойчивая разработка
be: Устойлівая распрацоўка
en: Sustainable development
uk: Стійка розробка

# screen.settings.whatsNew.3_1.pairDetails.subtitle
source: Узнайте больше подробностей о паре тапнув на ячейку в расписании
be: Даведайцеся больш падрабязнасцяў аб пары тапнуўшы на вочка ў раскладзе
en: Learn more about the pair by tapping on the cell in the schedule
uk: Дізнайтесь більше подробиць про пару тапнувши на комірку в розкладі

# screen.settings.whatsNew.3_1.pairDetails.title
source: Детали пары
be: Дэталі пары
en: Pair details
uk: Деталі пари

# screen.settings.whatsNew.3_1.roadmap.subtitle
source: Примите участие в планировании будущих фичей приложение в разделе "Дорожная карта"
be: Прыміце ўдзел у планаванні будучых фічаў прыкладанне ў раздзеле "Дарожная карта"
en: Help to form future of the application on the "Roadmap"
uk: Візьміть участь у плануванні майбутніх фічів додаток у розділі "Дорожня карта"

# screen.settings.whatsNew.3_1.roadmap.title
source: Дорожная карта
be: Дарожная карта
en: Roadmap
uk: Дорожня карта

# screen.settings.whatsNew.3_1.widgets.subtitle
source: Виджеты обновлены для поддержки новых конфигураций **StandBy** и **экрана блокировки iPad**.
be: Віджэты абноўлены для падтрымкі новых канфігурацый **StandBy** і **экрана блакіроўкі iPad**.
en: Widgets were updated to support new **StandBy** and **iPad lock screen** configurations
uk: Віджети оновлено для підтримки нових конфігурацій **StandBy** та **екрану блокування iPad**.

# screen.settings.whatsNew.3_1.widgets.title
source: Виджеты + iOS 17
be: Віджэты + iOS 17
en: Widgets + iOS 17
uk: Віджети + iOS 17

# screen.settings.whatsNew.3_2.examsWidgets.subtitle
source: Добавлены новые виджеты расписание сессии и экзаменов
be: Дададзены новыя віджэты расклад сесіі і экзаменаў
en: Added new widgets for session and exam schedules
uk: Додано нові віджети розклад сесії та іспитів

# screen.settings.whatsNew.3_2.examsWidgets.title
source: Виджеты Сессии и Экзаменов
be: Віджэты Сесіі і Экзаменаў
en: Session and Exam Widgets
uk: Віджети Сесії та Екзаменів

# screen.settings.whatsNew.3_2.subgroupFilter.subtitle
source: Теперь можно отфильтровать расписание по подгруппе, работает и в виджетах
be: Цяпер можна адфільтраваць расклад па падгрупе, працуе і ў віджэтах
en: Now you can filter the schedule by subgroup, it also works in widgets
uk: Тепер можна відфільтрувати розклад по підгрупі, працює і у віджетах

# screen.settings.whatsNew.3_2.subgroupFilter.title
source: Фильтр по подгруппе
be: Фільтр па падгрупе
en: Filter by subgroup
uk: Фільтр по підгрупі

# screen.settings.whatsNew.3_3.photoPreview.subtitle
source: Фото преподавателей в деталях пары теперь можно открыть на весь экран и наконец узнать как они выглядят
be: Фота выкладчыкаў у дэталях пары зараз можна адкрыць на ўвесь экран і нарэшце даведацца як яны выглядаюць
en: Photos of lecturers in the pair details can now be opened in full screen, you could finally find out what they look like
uk: Фото викладачів у деталях пари тепер можна відкрити на весь екран та нарешті дізнатися як вони виглядають

# screen.settings.whatsNew.3_3.photoPreview.title
source: Фото преподавателя
be: Фота выкладчыка
en: Lector photo
uk: Фото викладача

# screen.settings.whatsNew.3_4.iCloud.subtitle
source: Избранные и запиненное расписание теперь синхронизируется между устройствами через iCloud
be: Выбраныя і запінены расклад зараз сінхранізуецца паміж прыладамі праз iCloud
en: Favorites and pinned schedules now sync across devices via iCloud
uk: Вибраний та закритий розклад тепер синхронізується між пристроями через iCloud

# screen.settings.whatsNew.3_4.iCloud.title
source: Синхронизация с iCloud
be: Сінхранізацыя з iCloud
en: iCloud sync
uk: Синхронізація з iCloud

# screen.settings.whatsNew.3_4.observationTools.subtitle
source: Я опять переписал все экраны с использованием TCA 1.8 и новых Observation Tools. Все стало намного быстрее или медленнее, я не знаю...
be: Я ізноў перапісаў усе экраны з выкарыстаннем TCA 1.8 і новых Observation Tools. Усё стала нашмат хутчэй ці павольней, я не ведаю...
en: I rewrote all the screens again using TCA 1.8 and the new Observation Tools. Everything has become much faster or slower, I don't know...
uk: Я знову переписав усі екрани з використанням TCA 1.8 та нових Observation Tools. Все стало набагато швидше чи повільніше, я не знаю...

# screen.settings.whatsNew.3_4.observationTools.title
source: Архитектура
be: Архітэктура
en: Architecture
uk: Архітектура

# screen.settings.whatsNew.3_5.ios26Design.subtitle
source: Современный и более удобный внешний вид приложения
be: Сучасны і больш зручны знешні выгляд прыкладання
en: Modern and more convenient app appearance
uk: Сучасний і більш зручний зовнішній вигляд додатка

# screen.settings.whatsNew.3_5.ios26Design.title
source: Обновлён дизайн для iOS 26
be: Абноўлены дызайн для iOS 26
en: Updated Design for iOS 26
uk: Оновлений дизайн для iOS 26

# screen.settings.whatsNew.3_5.ipadLayout.subtitle
source: Улучшенное отображение интерфейса на больших экранах
be: Палепшанае адлюстраванне інтэрфейсу на вялікіх экранах
en: Improved interface display on large screens
uk: Покращене відображення інтерфейсу на великих екранах

# screen.settings.whatsNew.3_5.ipadLayout.title
source: Оптимизирован лейаут для iPad
be: Аптымізаваны макет для iPad
en: Optimized iPad Layout
uk: Оптимізований макет для iPad

# screen.settings.whatsNew.3_5.safeIcons.subtitle
source: Новый режим защищает от нежелательного контента при выборе иконок
be: Новы рэжым абараняе ад непажаданага кантэнту пры выбары іконак
en: New mode protects from unwanted content when selecting icons
uk: Новий режим захищає від небажаного контенту при виборі іконок

# screen.settings.whatsNew.3_5.safeIcons.title
source: Добавлен безопасный режим просмотра иконок приложения
be: Дададзены бяспечны рэжым прагляду іконак прыкладання
en: Added Safe App Icon Viewing Mode
uk: Додано безпечний режим перегляду іконок додатка

# screen.settings.whatsNew.3_5.schedulePerf.subtitle
source: Экран расписания теперь работает быстрее и плавнее
be: Экран раскладу цяпер працуе хутчэй і плаўней
en: Schedule screen now works faster and smoother
uk: Екран розкладу тепер працює швидше і плавніше

# screen.settings.whatsNew.3_5.schedulePerf.title
source: Повышена производительность экрана расписания
be: Павышана прадукцыйнасць экрана раскладу
en: Improved Schedule Screen Performance
uk: Підвищено продуктивність екрану розкладу

# screen.settings.whatsNew.button.gotIt
source: Понятно
be: Зразумела
en: Got it
uk: Зрозуміло

# screen.settings.whatsNew.navigation.title
source: Что нового
be: Што новага
en: What's new
uk: Що нового

# screen.widgetPreview.message%@
source: Прекрасные %@ на вашем рабочем столе!
be: Выдатныя %@ на вашым працоўным стале!
en: Beautiful %@ on your home screen!
uk: Прекрасні %@ на вашому робочому столі!

# screen.widgetPreview.widgets
source: Виджеты
be: Віджэты
en: Widgets
uk: Віджети

# view.errorState.apiDown.button.issue.label
source: Создать задачу
be: Стварыць задачу
en: Create issue
uk: Створити завдання

# view.errorState.apiDown.button.retry.label
source: Повторить
be: Паўтарыць
en: Try again
uk: Повторити

# view.errorState.apiDown.message
source: Похоже, у API БГУИРа какие-то проблемы. Если вы считаете, что это моя вина, пожалуйста, скопируйте следующий текст и свяжитесь с разработчиком или создайте задачу
be: Падобна, у API БДУІРа нейкія праблемы. Калі вы лічыце, што гэта мая віна, калі ласка, скапіруйце наступны тэкст і звяжыцеся з распрацоўшчыкам або стварыце задачу
en: Looks like Bsuir API is having some troubles. If you think it is my fault please copy following text and contact developer or create an issue
uk: Схоже, у API БДУІР якісь проблеми. Якщо ви вважаєте, що це моя вина, будь ласка, скопіюйте наступний текст і зв'яжіться з розробником або створіть завдання

# view.errorState.apiDown.title.%@
source: Запрос не удался, код ошибки: %@
be: Запыт не атрымаўся, код памылкі: %@
en: Request failed with code: %@
uk: Запит не вдався, код помилки: %@

# view.errorState.button.label
source: Повторить попытку
be: Паўтарыць спробу
en: Retry
uk: Повторити спробу

# view.errorState.noInternet.button.label
source: Попробовать снова
be: Паспрабаваць зноў
en: Try again
uk: Спробувати знову

# view.errorState.noInternet.message
source: Похоже, нет подключения к интернету. Пожалуйста, проверьте подключение и повторите попытку...
be: Здаецца, няма падключэння да інтэрнэту. Калі ласка, праверце падключэнне і паўтарыце спробу...
en: Looks like there's no connection to the internet. Please check your connection and try again...
uk: Схоже, немає підключення до Інтернету. Перевірте підключення та повторіть спробу...

# view.errorState.noInternet.title
source: Нет подключения к интернету
be: Няма падключэння да інтэрнэту
en: No connection to the internet
uk: Немає підключення до Інтернету

# view.errorState.noSchedule.button.label
source: Попробовать снова
be: Паспрабаваць зноў
en: Try again
uk: Спробувати знову

# view.errorState.noSchedule.message
source: Похоже, расписание для этой группы или преподавателя еще не готово. Попробуйте проверить позже...
be: Падобна, расклад для гэтай групы або выкладчыка яшчэ не гатовы. Паспрабуйце праверыць пазней...
en: Looks like the schedule for this group or lecturer is not ready yet. Try check it again later...
uk: Схоже, розклад для цієї групи чи викладача ще не готовий. Спробуйте перевірити пізніше...

# view.errorState.noSchedule.title
source: Нет расписания
be: Няма раскладу
en: No schedule
uk: Немає розкладу

# view.errorState.parsing.button.label
source: Создать задачу
be: Стварыць задачу
en: Create issue
uk: Створити завдання

# view.errorState.parsing.message
source: Получен неожиданный ответ от API. Пожалуйста, скопируйте следующий текст и свяжитесь с разработчиком или создайте задачу
be: Атрыманы нечаканы адказ ад API. Калі ласка, скапіруйце наступны тэкст і звяжыцеся з распрацоўшчыкам або стварыце задачу
en: Received unexpected response from the API. Please copy following text and contact developer or create an issue
uk: Отримана несподівана відповідь від API. Будь ласка, скопіюйте наступний текст і зв'яжіться з розробником або створіть завдання

# view.errorState.parsing.title
source: Не удалось декодировать ответ
be: Не ўдалося дэкадаваць адказ
en: Failed to parse response
uk: Не вдалося декодувати відповідь

# view.errorState.title
source: Что-то пошло не так...
be: Нешта пайшло не так...
en: Something went wrong...
uk: Щось пішло не так...

# view.pairView.accessibility.auditory.%@
source: аудитория: %@
be: аўдыторыя: %@
en: audithory: %@
uk: аудиторія: %@

# view.pairView.accessibility.from.%@.to.%@
source: с %@ по %@
be: з %@ па %@
en: from %@ to %@
uk: з %@ до %@

# view.pairView.accessibility.label
source: Идет сейчас
be: Ідзе зараз
en: Going on now
uk: Йде зараз

# view.pairView.accessibility.subgroup.%@
source: Подгруппа: %@
be: Падгрупа: %@
en: Subgroup: %@
uk: Підгрупа: %@

# view.pairView.accessibility.weeks.%@
source: Недели: %@
be: Тыдні: %@
en: Weeks: %@
uk: Тижня: %@

# view.pairView.announcement.title
source: 📣 Объявление
be: 📣 Аб'ява
en: 📣 Announcement
uk: 📣 Оголошення

# view.pairView.form.name.consultation
source: Консультация
be: Кансультацыя
en: Consultation
uk: Консультація

# view.pairView.form.name.exam
source: Экзамен
be: Іспыт
en: Exam
uk: Іспит

# view.pairView.form.name.lab
source: Лабораторная работа
be: Лабараторная работа
en: Laboratory lesson
uk: Лабораторна робота

# view.pairView.form.name.lecture
source: Лекция
be: Лекцыя
en: Lecture
uk: Лекція

# view.pairView.form.name.practice
source: Практическая работа
be: Практычная работа
en: Practical lesson
uk: Практична робота

# view.pairView.form.name.test
source: Зачет
be: Залік
en: Test
uk: Залік

# view.pairView.form.name.unknown
source: Неизвестно
be: Невядома
en: Unknown
uk: Невідомо

# view.pairView.form.name.unknown.named%@
source: Неизвестно/%@
be: Невядома/%@
en: Unknown/%@
uk: Невідомо/%@

# view.subgroupPicker.allSubgroups.title
source: Все
be: Усе
en: All
uk: Усе

# view.subgroupPicker.subgroup.title%@
source: Подгруппа %@
be: Падгрупа %@
en: Subgroup %@
uk: Підгрупа %@

# view.subgroupPicker.title
source: Подгруппа
be: Падгрупа
en: Subgroup
uk: Підгрупа

# view.tabBar.favorites.title
source: Избранные
be: Выбраныя
en: Favorites
uk: Вибрані

# view.tabBar.groups.title
source: Группы
be: Групы
en: Groups
uk: Групи

# view.tabBar.lecturers.title
source: Преподаватели
be: Выкладчыкі
en: Lecturers
uk: Викладачі

# view.tabBar.pinned.empty.title
source: Закреплённое
be: Замацаванае
en: Pinned
uk: Закріплене

# view.tabBar.settings.title
source: Настройки
be: Налады
en: Settings
uk: Налаштування

# alert.goodIconChoice.message
source: Жыве Беларусь!
en: Long live Belarus!
uk: Живе Білорусь!

# screen.groups.row.course%@
source: %@ курс
en: Course %@

# screen.groups.search.suggested.course.%@
source: %@ курс
en: Course %@

# screen.groups.search.suggested.noCourse
source: Без курса
en: No course
uk: Без курсу

# screen.premiumClub.section.membership.title
source: Клуб
en: Membership

# screen.settings.appearance.pairPreview.weeks
source: нед.
en: week
uk: тиж.

# screen.settings.appIcon.icon.default.title
source: Стандартная
en: Default
uk: Стандартна

# screen.settings.appIcon.iconPicker.neon.title
source: Неон
en: Neon

# view.loadingState.title
source: Загрузка...
en: Loading...
uk: Завантаження...
